package com.mukho.ssammubot.utils

class FoodUtil {
    companion object {
        private val foods = listOf(
            // 기타
            "굶으세요", "물", "거공", "솔 에르다 조각", "과자", "편의점 도시락",
            // 빵
            "소보루빵", "단팥빵", "크림빵", "슈크림빵", "앙버터빵", "멜론빵", "밤식빵", "고구마빵",
            "피자빵", "소시지빵", "베이컨치즈빵", "감자고로케빵", "갈릭바게트", "치즈바게트", "콘마요빵",
            "크루아상", "페스츄리", "치아바타", "포카치아", "브리오슈", "바게트",
            // 샌드위치
            "샌드위치", "햄치즈샌드위치", "에그샌드위치", "치킨샌드위치", "햄샌드위치", "토마토샌드위치", "햄치즈토스트", "햄치즈샌드위치", "햄치즈토스트", "햄치즈샌드위치",
            // 치킨
            "치킨", "후라이드치킨", "양념치킨", "간장치킨", "마늘치킨", "치즈치킨", "파닭", "핫양념치킨", "스노윙치킨", "매운치킨", "닭강정",
            "닭똥집튀김", "닭껍질튀김", "데리야끼치킨", "숯불바베큐치킨", "블랙페퍼치킨", "불닭", "크리스피치킨", "뿌링클치킨", "갈릭치킨", "로제치킨",
            "황금올리브치킨", "매콤닭강정", "양파치킨", "숯불간장치킨", "핫윙", "순살치킨", "치킨텐더", "고추바사삭", "반반치킨", "BBQ치킨",
            "허니버터치킨", "깐풍치킨", "트러플치킨", "매운치즈치킨", "캡사이신치킨", "타바스코치킨", "와사비치킨", "데리야끼순살치킨", "치킨가라아게", "스윗칠리치킨",
            // 피자
            "피자", "페퍼로니피자", "마르게리타피자", "고르곤졸라피자", "하와이안피자", "치즈크러스트피자", "콤비네이션피자", "불고기피자", "포테이토피자", "치킨바베큐피자", "화이트피자",
            "시카고피자", "디트로이트피자", "버섯피자", "고구마피자", "BBQ피자", "스테이크피자", "트러플피자", "멕시칸피자", "해물피자", "사천피자",
            "베이컨피자", "비스마르크피자", "루꼴라피자", "프로슈토피자", "엔초비피자", "할라피뇨피자", "스핀치피자", "네오폴리탄피자", "미트러버피자", "버팔로치킨피자",
            // 햄버거
            "햄버거", "치즈버거", "더블치즈버거", "트리플치즈버거", "불고기버거", "베이컨치즈버거", "베이컨더블버거", "모짜렐라버거", "스페셜버거", "버거킹 와퍼",
            "비프버거", "아메리칸버거", "트러플버거", "한우버거", "스테이크버거", "갈릭버거", "BBQ버거", "치킨버거", "포크버거", "돈까스버거", "BBQ포크버거", "새우버거", "통새우버거",
            "빅맥", "더블쿼터파운더치즈", "맥스파이시상하이버거", "슈슈버거", "맥치킨", "치킨필레버거", "와퍼주니어", "몬스터X", "핫크리스피버거", "에그불고기버거",
            // 한식
            "비빔밥", "돌솥비빔밥", "콩나물국밥", "돼지국밥", "순댓국", "청국장", "보쌈정식", "불고기덮밥", "제육볶음", "낙곱새", "수제비",
            // 중식
            "짜장면", "짬뽕", "볶음밥", "탕수육", "깐풍기", "양장피", "마파두부", "유린기", "칠리새우", "사천탕수육",
            "해물짬뽕", "고추잡채", "깐쇼새우", "유산슬", "중화비빔밥", "고기만두", "새우만두", "춘권", "라조기", "마라탕",
            "마라샹궈", "마라롱샤", "고량주안주", "송이볶음", "새우볶음밥", "잡채밥", "깐풍새우", "크림새우", "홍소육", "꿔바로우",
            "사천식가지볶음", "북경오리", "대만우육면", "홍콩식차슈덮밥", "동파육", "마라판면", "마라비빔면", "샤오롱바오", "라조면", "꽃빵튀김",
            // 일식
            "돈부리", "규동", "가츠동", "텐동", "우나기동", "사케동", "오야코동", "소바", "우동", "라멘",
            "타코야키", "오코노미야키", "초밥", "니기리즈시", "사시미", "스키야키", "야키토리", "가라아게", "오뎅", "카레라이스",
            // 양식
            "스테이크", "필레미뇽", "리조또", "까르보나라", "알리오올리오", "뇨끼", "라자냐", "파니니", "바게트샌드위치", "치킨커틀렛",
            // 찜/탕
            "김치찌개", "된장찌개", "순두부찌개", "부대찌개", "동태찌개", "곰탕", "설렁탕", "갈비탕", "사골국", "내장탕",
            "뼈해장국", "추어탕", "삼계탕", "닭계장", "육개장", "해물탕", "매운탕", "아귀찜", "코다리찜", "갈비찜",
            "꼬리곰탕", "낙지전골", "버섯전골", "꽃게탕", "홍합탕", "복지리탕", "감자탕", "선지해장국", "동태전골", "도가니탕",
            //돈까스
            "일반돈까스", "치즈돈까스", "매운돈까스", "고구마돈까스", "멘치까스", "안심돈까스", "등심돈까스", "생선까스", "커리돈까스", "함박스테이크",
            // 회
            "연어회", "광어회", "우럭회", "참치회", "방어회", "농어회", "도미회", "전어회", "고등어회", "한치회",
            // 면
            "칼국수", "잔치국수", "막국수", "메밀소바", "토마토파스타", "봉골레파스타", "미고랭",
            "팟타이", "야끼소바", "냉면", "비빔냉면", "나가사키짬뽕", "탄탄멘", "사리곰탕라면", "불닭볶음면",
            "평양냉면", "함흥냉면", "컵라면", "라면", "우육면", "짜파게티", "비빔면", "마파두부면", "비빔면", "쌀국수", "베트남쌀국수",
            // 고기류
            "삼겹살", "소고기", "양고기", "목살", "양념갈비", "소고기등심", "한우채끝살", "LA갈비", "돼지갈비", "토시살", "차돌박이", "항정살",
            "가브리살", "스테이크", "티본스테이크", "립아이", "안심스테이크", "토마호크스테이크", "훈제오리", "숯불닭갈비", "돼지불백", "닭갈비", "닭가슴살",
            // 떡볶이
            "떡볶이", "치즈떡볶이", "로제떡볶이", "짜장떡볶이", "고추장떡볶이", "간장떡볶이", "크림떡볶이", "마라떡볶이", "카레떡볶이", "매운떡볶이",
            "차돌떡볶이", "해물떡볶이", "떡라면", "수제비떡볶이", "밀떡볶이", "쌀떡볶이", "즉석떡볶이", "버터떡볶이", "닭갈비떡볶이", "튀김떡볶이",
            // 김밥
            "김밥", "참치김밥", "치즈김밥", "돈까스김밥", "불고기김밥", "새우김밥", "스팸김밥", "멸치김밥", "김치김밥", "계란말이김밥",
            "야채김밥", "크래미김밥", "매운참치김밥", "날치알김밥", "고추김밥", "유부김밥", "닭가슴살김밥", "연어김밥", "명란마요김밥", "제육김밥",
            // 튀김
            "오징어튀김", "고구마튀김", "김말이튀김", "야채튀김", "새우튀김", "떡튀김", "닭다리튀김", "치즈스틱", "고추튀김", "만두튀김",
            "감자튀김", "치킨너겟", "치킨가라아게", "핫도그튀김", "스팸튀김", "가지튀김", "소세지튀김", "깻잎튀김", "양파링튀김", "바나나튀김",
            // 분식
            "순대", "간순대", "암뽕순대", "순대볶음", "철판순대", "떡순튀", "오뎅", "유부오뎅", "국물오뎅", "야끼오뎅",
            "비빔만두", "군만두", "찐만두", "김치만두", "고기만두", "핫도그", "소떡소떡", "치즈핫도그", "감자핫도그", "옥수수핫도그",
        )

        fun randomFood(): String {
            return foods.random()
        }
    }
}